Feature: แก้ไขประเภทห้อง
    As a ผู้จัดการหอพัก I want to แก้ไขข้อมูลของประเภทห้อง และราคาค่าเช่า ทั้งแบบรายเดือน และรายวันในหอพักได้

Background:
    Given มีประเภทห้องที่ชื่อประเภทเป็น อยู่ดีกินดี และราคาค่าเช่ารายเดือนเป็น 3000 ราคาค่าเช่ารายวันเป็น 300

Scenario:
    When กดแก้ไขประเภทห้องจากประเภทห้องอยู่ดีกินดี จากนั้นใส่ชื่อประเภทเป็น อยู่กินดีดี และราคาค่าเช่ารายเดือนเป็น 3500 ราคาค่าเช่ารายวันเป็น 350 แล้วกดตกลง
    Then ประเภทห้องเดิมถูกมีชื่อประเภทคือ อยู่กินดีดี และมีราคาค่าเช่ารายเดือนคือ 3500 ราคาค่าเช่ารายวันคือ 350